[
    {
        "name": "Spider-Man no way Home",
        "country": "USA",
        "year": 2021,
        "img": "https://comic-cons.xyz/wp-content/uploads/marvel-cinematic-universe-spiderman-no-way-home-movie-poster-230x341.jpg",
        "trailer": "https://www.youtube.com/embed/JfVOs4VSpmA",
        "details": "Spider-Man: No Way Home is a 2021 American superhero film based on the Marvel Comics character Spider-Man, co-produced by Columbia Pictures and Marvel Studios and distributed by Sony Pictures Releasing. It is the sequel to Spider-Man: Homecoming (2017) and Spider-Man: Far From Home (2019), and the 27th film in the Marvel Cinematic Universe (MCU). The film was directed by Jon Watts and written by Chris McKenna and Erik Sommers. It stars Tom Holland as Peter Parker / Spider-Man alongside Zendaya, Benedict Cumberbatch, Jacob Batalon, Jon Favreau, Jamie Foxx, Willem Dafoe, Alfred Molina, Benedict Wong, Tony Revolori, Marisa Tomei, Andrew Garfield, and Tobey Maguire. In the film, Parker asks Dr. Stephen Strange (Cumberbatch) to use magic to make his identity as Spider-Man a secret again following its public revelation at the end of Far From Home. When the spell goes wrong, the multiverse is broken open, which allows visitors from alternate realities to enter Parker's universe. A third MCU Spider-Man film was planned during the production of Homecoming in 2017. Negotiations between Sony and Marvel Studios to alter their deal—in which they produce the Spider-Man films together—ended with Marvel Studios leaving the project in August 2019, but a negative fan reaction led to a new deal between the companies a month later. Watts, McKenna, Sommers, and Holland were set to return, and filming took place from October 2020 to March 2021 in New York City and Atlanta. No Way Home features several actors reprising their roles from non-MCU Spider-Man films directed by Sam Raimi and Marc Webb, including previous Spider-Man actors Maguire and Garfield. The involvement of both actors was the subject of wide speculation and numerous leaks despite the efforts of Sony, Marvel, and the cast to conceal their involvement."
    },
    {
        "name": "Shang Chi",
        "country": "USA",
        "year": 2021,
        "img": "https://comic-cons.xyz/wp-content/uploads/marvel-cinematic-universe-shang-chi-and-the-legend-of-the-ten-rings-movie-poster-230x341.jpg",
        "trailer": "https://www.youtube.com/embed/8YjFbMbfXaQ",
        "details": "Shang-Chi and the Legend of the Ten Rings is a 2021 American superhero film based on Marvel Comics featuring the character Shang-Chi. Produced by Marvel Studios and distributed by Walt Disney Studios Motion Pictures, it is the 25th film in the Marvel Cinematic Universe (MCU). The film was directed by Destin Daniel Cretton, from a screenplay he wrote with Dave Callaham and Andrew Lanham, and stars Simu Liu as Shang-Chi alongside Awkwafina, Meng'er Zhang, Fala Chen, Florian Munteanu, Benedict Wong, Michelle Yeoh, Ben Kingsley, and Tony Leung. In the film, Shang-Chi is forced to confront his past when his father Wenwu (Leung), the leader of the Ten Rings organization, draws Shang-Chi and his sister Xialing (Zhang) into a search for a mythical village. A film based on Shang-Chi entered development in 2001, but work did not begin in earnest until December 2018 when Callaham was hired. Cretton joined in March 2019, with the project fast-tracked as Marvel's first film with an Asian lead. The film's title and primary cast were announced that July, revealing the film's connection to the Ten Rings organization, which previously appeared throughout the MCU, and its leader Wenwu. Shang-Chi and the Legend of the Ten Rings is the first Marvel Studios film with an Asian director and a predominantly Asian cast. Filming began in Sydney in February 2020 but was put on hold in March due to the COVID-19 pandemic. Production resumed in August before completing in October, with additional shooting occurring in San Francisco."
    },
    {
        "name": "Avengers: Endgame",
        "country": "USA",
        "year": 2019,
        "img": "https://comic-cons.xyz/wp-content/uploads/marvel-cinematic-universe-the-avengers-endgame-movie-poster-230x341.jpg",
        "trailer": "https://www.youtube.com/embed/TcMBFSGVi1c",
        "details": "Avengers: Endgame is a 2019 American superhero film based on the Marvel Comics superhero team the Avengers. Produced by Marvel Studios and distributed by Walt Disney Studios Motion Pictures, it is the direct sequel to Avengers: Infinity War (2018) and the 22nd film in the Marvel Cinematic Universe (MCU). Directed by Anthony and Joe Russo and written by Christopher Markus and Stephen McFeely, the film features an ensemble cast including Robert Downey Jr., Chris Evans, Mark Ruffalo, Chris Hemsworth, Scarlett Johansson, Jeremy Renner, Don Cheadle, Paul Rudd, Brie Larson, Karen Gillan, Danai Gurira, Benedict Wong, Jon Favreau, Bradley Cooper, Gwyneth Paltrow, and Josh Brolin. In the film, the surviving members of the Avengers and their allies attempt to reverse the destruction caused by Thanos in Infinity War. The film was announced in October 2014 as Avengers: Infinity War – Part 2, but Marvel later removed this title. The Russo brothers joined as directors in April 2015, with Markus and McFeely signing on to write the script a month later. The film serves as a conclusion to the story of the MCU up to that point, ending the story arcs for several main characters. The plot revisits several moments from earlier films, bringing back actors and settings from throughout the franchise. Filming began in August 2017 at Pinewood Atlanta Studios in Fayette County, Georgia, shooting back-to-back with Infinity War, and ended in January 2018. Additional filming took place in the Metro and Downtown Atlanta areas, New York state, Scotland, and England. The official title was revealed in December 2018. With an estimated budget of $356–400 million, the film is one of the most expensive films ever made."
    },
    {
        "name": "Avengers: Infinity War",
        "country": "USA",
        "year": 2018,
        "img": "https://comic-cons.xyz/wp-content/uploads/marvel-cinematic-universe-the-avengers-infinity-war-movie-poster-230x341.jpg",
        "trailer": "https://www.youtube.com/embed/6ZfuNTqbHE8",
        "details": "Avengers: Infinity War is a 2018 American superhero film based on the Marvel Comics superhero team the Avengers. Produced by Marvel Studios and distributed by Walt Disney Studios Motion Pictures, it is the sequel to The Avengers (2012) and Avengers: Age of Ultron (2015), and the 19th film in the Marvel Cinematic Universe (MCU). Directed by Anthony and Joe Russo and written by Christopher Markus and Stephen McFeely, the film features an ensemble cast including Robert Downey Jr., Chris Hemsworth, Mark Ruffalo, Chris Evans, Scarlett Johansson, Benedict Cumberbatch, Don Cheadle, Tom Holland, Chadwick Boseman, Paul Bettany, Elizabeth Olsen, Anthony Mackie, Sebastian Stan, Danai Gurira, Letitia Wright, Dave Bautista, Zoe Saldaña, Josh Brolin, and Chris Pratt. In the film, the Avengers and the Guardians of the Galaxy attempt to prevent Thanos from collecting the six all-powerful Infinity Stones as part of his quest to kill half of all life in the universe. The film was announced in October 2014 as Avengers: Infinity War – Part 1. The Russo brothers came on board to direct in April 2015, and a month later Markus and McFeely had signed on to write the script for the film, which draws inspiration from Jim Starlin's 1991 comic book The Infinity Gauntlet and Jonathan Hickman's 2013 comic book Infinity. In 2016, Marvel shortened the title to Avengers: Infinity War. Filming began in January 2017 at Pinewood Atlanta Studios in Fayette County, Georgia, with a large cast consisting mostly of actors reprising their roles from previous MCU films, including Brolin as Thanos. The production lasted until July 2017, shooting back-to-back with a direct sequel, Avengers: Endgame (2019). Additional filming took place in Scotland, the Downtown Atlanta area, and New York City. With an estimated budget of $325–400 million, the film is one of the most expensive films ever made."
    },

    {
        "name": "Guardians of the Galaxy",
        "country": "USA",
        "year": 2014,
        "img": "https://comic-cons.xyz/wp-content/uploads/marvel-cinematic-universe-guardians-of-the-galaxy-movie-poster-230x341.jpg",
        "trailer": "https://www.youtube.com/embed/d96cjJhvlMA",
        "details": "Guardians of the Galaxy (retroactively referred to as Guardians of the Galaxy Vol. 1)[4][5] is a 2014 American superhero film based on the Marvel Comics superhero team of the same name. Produced by Marvel Studios and distributed by Walt Disney Studios Motion Pictures, it is the 10th film in the Marvel Cinematic Universe (MCU). Directed by James Gunn, who wrote the screenplay with Nicole Perlman, the film features an ensemble cast including Chris Pratt, Zoe Saldaña, Dave Bautista, Vin Diesel, and Bradley Cooper as the titular Guardians, along with Lee Pace, Michael Rooker, Karen Gillan, Djimon Hounsou, John C. Reilly, Glenn Close, and Benicio del Toro. In the film, Peter Quill and a group of extraterrestrial criminals go on the run after stealing a powerful artifact. Perlman began working on the screenplay in 2009. Producer Kevin Feige first publicly mentioned Guardians of the Galaxy as a potential film in 2010 and Marvel Studios announced it was in active development at the July 2012 San Diego Comic-Con. Gunn was hired to write and direct the film that September. In February 2013, Pratt was hired to play Peter Quill / Star-Lord, and the supporting cast members were subsequently confirmed. Principal photography began in July 2013 at Shepperton Studios in England, with filming continuing in London before wrapping up in October 2013. In addition to an original score by Tyler Bates, the film's soundtrack includes several popular songs from the 1960s and 1970s chosen by Gunn. Post-production was completed on July 7, 2014."
    },
    {
        "name": "Captain Marvel",
        "country": "USA",
        "year": 2019,
        "img": "https://comic-cons.xyz/wp-content/uploads/marvel-cinematic-universe-captain-marvel-movie-poster-230x341.jpg",
        "trailer": "https://www.youtube.com/embed/Z1BCujX3pw8",
        "details": "Captain Marvel is a 2019 American superhero film based on Marvel Comics featuring the character Carol Danvers / Captain Marvel. Produced by Marvel Studios and distributed by Walt Disney Studios Motion Pictures, it is the 21st film in the Marvel Cinematic Universe (MCU). The film was written and directed by Anna Boden and Ryan Fleck, with Geneva Robertson-Dworet also contributing to the screenplay. Brie Larson stars as Carol Danvers, alongside Samuel L. Jackson, Ben Mendelsohn, Djimon Hounsou, Lee Pace, Lashana Lynch, Gemma Chan, Annette Bening, Clark Gregg, and Jude Law. Set in 1995, the story follows Danvers as she becomes Captain Marvel after Earth is caught in the center of a galactic conflict between two alien civilizations. Development of the film began by May 2013. It was officially announced in October 2014 as Marvel Studios' first female-led superhero film. Nicole Perlman and Meg LeFauve were hired to write the film the following April after submitting separate takes on the character, and borrowed elements from Roy Thomas' 1971 'Kree–Skrull War' comic book storyline. Larson was announced as Danvers at the 2016 San Diego Comic-Con, with Boden and Fleck hired to direct in April 2017. Robertson-Dworet was soon hired to re-write the script, with the rest of the cast added by the start of filming. Location shooting began in January 2018, with principal photography starting that March in California and concluding in Louisiana in July 2018. Several actors reprise their roles from previous MCU films in Captain Marvel, including Jackson and Gregg who were digitally de-aged in post-production to reflect the film's 1990s setting."
    },
    {
        "name": "Spider-Man far from Home",
        "country": "USA",
        "year": 2019,
        "img": "https://comic-cons.xyz/wp-content/uploads/marvel-cinematic-universe-spiderman-far-from-home-movie-poster-230x341.jpg",
        "trailer": "https://www.youtube.com/embed/Nt9L1jCKGnE",
        "details": "Spider-Man: Far From Home is a 2019 American superhero film based on the Marvel Comics character Spider-Man, co-produced by Columbia Pictures and Marvel Studios, and distributed by Sony Pictures Releasing. It is the sequel to Spider-Man: Homecoming (2017) and the 23rd film in the Marvel Cinematic Universe (MCU). The film was directed by Jon Watts, written by Chris McKenna and Erik Sommers, and stars Tom Holland as Peter Parker / Spider-Man, alongside Samuel L. Jackson, Zendaya, Cobie Smulders, Jon Favreau, J. B. Smoove, Jacob Batalon, Martin Starr, Marisa Tomei, and Jake Gyllenhaal. In the film, Parker is recruited by Nick Fury (Jackson) and Mysterio (Gyllenhaal) to face the Elementals while he is on a school trip to Europe. Discussions for a sequel to Spider-Man: Homecoming began by October 2016, and the project was confirmed later that year. Holland, Watts, and the writers were all set to return by the end of 2017. In 2018, Jackson and Gyllenhaal joined the cast as Fury and Mysterio, respectively. Holland revealed the sequel's title ahead of filming, which began that July and took place in England, the Czech Republic, Italy, and the New York metropolitan area. Production wrapped in October 2018. The marketing campaign is one of the most expensive for a film ever and attempted to avoid revealing spoilers for Avengers: Endgame prior to its April 2019 release."
    },
    {
        "name": "Black Panther",
        "country": "USA",
        "year": 2018,
        "img": "https://comic-cons.xyz/wp-content/uploads/marvel-cinematic-universe-black-panther-movie-poster-230x341.jpg",
        "trailer": "https://www.youtube.com/embed/xjDjIWPwcPU",
        "details": "Black Panther is a 2018 American superhero film based on the Marvel Comics character of the same name. Produced by Marvel Studios and distributed by Walt Disney Studios Motion Pictures, it is the 18th film in the Marvel Cinematic Universe (MCU). The film was directed by Ryan Coogler, who co-wrote the screenplay with Joe Robert Cole, and it stars Chadwick Boseman as T'Challa / Black Panther alongside Michael B. Jordan, Lupita Nyong'o, Danai Gurira, Martin Freeman, Daniel Kaluuya, Letitia Wright, Winston Duke, Angela Bassett, Forest Whitaker, and Andy Serkis. In Black Panther, T'Challa is crowned king of Wakanda following his father's death, but he is challenged by Killmonger (Jordan), who plans to abandon the country's isolationist policies and begin a global revolution. Wesley Snipes planned to make a Black Panther film in 1992, but the project did not come to fruition. In September 2005, Marvel Studios listed a Black Panther film as one of ten films based on Marvel characters intended to be distributed by Paramount Pictures. Mark Bailey was hired to write a script in January 2011. Black Panther was officially announced in October 2014, and Boseman made his first appearance as the character in Captain America: Civil War (2016). Cole and Coogler had joined by then, with additional casting in May. Black Panther is the first Marvel Studios film with a Black director and a predominantly Black cast. Principal photography took place from January to April 2017 at EUE/Screen Gems Studios in the Atlanta metropolitan area, and in Busan, South Korea."
    },
    {
        "name": "Thor: Ragnarok",
        "country": "USA",
        "year": 2017,
        "img": "https://comic-cons.xyz/wp-content/uploads/marvel-cinematic-universe-thor-ragnarok-movie-poster-230x341.jpg",
        "trailer": "https://www.youtube.com/embed/ue80QwXMRHg",
        "details": ""
    },
    {
        "name": "The Incredible Hulk",
        "country": "USA",
        "year": 2008,
        "img": "https://comic-cons.xyz/wp-content/uploads/marvel-cinematic-universe-the-incredible-hulk-movie-poster-230x341.jpg",
        "trailer": "https://www.youtube.com/embed/xbqNb2PFKKA",
        "details": "The Incredible Hulk is a 2008 American superhero film based on the Marvel Comics character the Hulk. Produced by Marvel Studios and distributed by Universal Pictures, it is the second film in the Marvel Cinematic Universe (MCU). It was directed by Louis Leterrier from a screenplay by Zak Penn, and stars Edward Norton as Bruce Banner alongside Liv Tyler, Tim Roth, Tim Blake Nelson, Ty Burrell, and William Hurt. In the film, Bruce Banner becomes the Hulk as an unwitting pawn in a military scheme to reinvigorate the 'Super-Soldier' program through gamma radiation. Banner goes on the run from the military while attempting to cure himself of the Hulk. After the mixed reception to Universal's 2003 film Hulk, Marvel Studios reacquired the rights to the character though Universal retained distribution rights. Leterrier, who had expressed interest in directing Iron Man for Marvel, was brought onboard and Penn began work on a script that would be much closer to the comics and the 1978 television series of the same name. In April 2007, Norton was hired to portray Banner and to rewrite Penn's screenplay. His script positioned the film as a reboot of the series, distancing it from the 2003 film to give the new version its own identity. Norton was ultimately not credited for his writing. Filming took place from July to November 2007, primarily in Toronto, Canada, with additional filming in New York City and Rio de Janeiro. Over 700 visual effects shots were created in post-production using a combination of motion capture and computer-generated imagery to complete the film."
    },
    {
        "name": "Thor",
        "country": "USA",
        "year": 2011,
        "img": "https://comic-cons.xyz/wp-content/uploads/marvel-cinematic-universe-thor-movie-poster-230x341.jpg",
        "trailer": "https://www.youtube.com/embed/JOddp-nlNvQ",
        "details": "Thor is a 2011 American superhero film based on the Marvel Comics character of the same name. Produced by Marvel Studios and distributed by Paramount Pictures,[N 1] it is the fourth film in the Marvel Cinematic Universe (MCU). It was directed by Kenneth Branagh, written by the writing team of Ashley Edward Miller and Zack Stentz along with Don Payne, and stars Chris Hemsworth as the title character alongside Natalie Portman, Tom Hiddleston, Stellan Skarsgård, Colm Feore, Ray Stevenson, Idris Elba, Kat Dennings, Rene Russo, and Anthony Hopkins. After reigniting a dormant war, Thor is banished from Asgard to Earth, stripped of his powers and his hammer Mjölnir. As his brother Loki (Hiddleston) plots to take the Asgardian throne, Thor must prove himself worthy. Sam Raimi first developed the concept of a film adaptation based on Thor in 1991, but soon abandoned the project, leaving it in 'development hell' for several years. During this time, the rights were picked up by various film studios until Marvel signed Mark Protosevich to develop the project in 2006, and planned to finance and release it through Paramount. Matthew Vaughn was assigned to direct the film for a tentative 2010 release. However, after Vaughn was released from his holding deal in 2008, Branagh was approached and the film's release was rescheduled to 2011. The main characters were cast in 2009, and principal photography took place in California and New Mexico from January to May 2010. The film was converted to 3D in post-production."
    }
]